# FixedFabricationPartNotChangeLength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MEPFabricationFailures..::..FixedFabricationPartNotChangeLength Property
BuiltInFailures..::..MEPFabricationFailures Class See Also
---
Failed to change length of fixed part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FixedFabricationPartNotChangeLength { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FixedFabricationPartNotChangeLength As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FixedFabricationPartNotChangeLength {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MEPFabricationFailures Class
Autodesk.Revit.DB Namespace